# ModelPath Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ModelPath Members
ModelPath Class Methods Properties See Also
---
The ModelPath type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Compare | Compares this ModelPath with another |
| Dispose | Releases all resources used by the ModelPath |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetModelGUID | A GUID identifying the Revit cloud model. |
| GetProjectGUID | A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CentralServerPath | The path to the location of the central Revit server or cloud. |
| CloudPath | Whether this path represents a path on an Autodesk server such as BIM360. |
| Empty | Whether this path is empty |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Region | The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model. |
| ServerPath | Whether this path is a server path (as opposed to a file path or cloud path) |

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace